# St7SetPathLabelStyle

Sets the display style for load path labels.

long St7SetPathLabelStyle(long uID, long LabelStyle)
Input Parameters
uID
Strand7 model file ID.
LabelStyle
One of lsNone, lsEntityNumber or lsLaneNumber.
Dependencies
Font
Assigned using St7SetEntityFont.